Public Member Functions | Public Attributes | List of all members
API_ElemType Struct Reference
Element Manager API
The type of an element. More...
#include <APIdefs_Elements.h>
 Public Member Functions
API_ElemType ()=default
API_ElemType (API_ElemTypeID typeID)
API_ElemType (API_ElemTypeID typeID, API_ElemVariationID variationID)
API_ElemType (const API_Guid &classID)
API_ElemType &  | operator= (const API_ElemType &)=default
Assignment operator (by element type).
API_ElemType &  | operator= (API_ElemTypeID newTypeID)
Assignment operator (by element type).
API_ElemType &  | operator= (const API_Guid &newClassID)
Assignment operator (by element class identifier).
bool  | operator== (const API_ElemType &other) const
Comparison operator (by element type).
bool  | operator!= (const API_ElemType &other) const
Comparison operator (by element type).
bool  | operator== (API_ElemTypeID otherTypeID) const
Comparison operator (by element type ID).
bool  | operator!= (API_ElemTypeID otherTypeID) const
Comparison operator (by element type ID).
bool  | operator== (const API_Guid &otherClassID) const
Comparison operator (by class ID; for external elements).
bool  | operator!= (const API_Guid &otherClassID) const
Comparison operator (by class ID; for external elements).
ULong  | GenerateHashValue (void) const
Generates unique identifier.
 Public Attributes
API_ElemTypeID  | typeID
The typeID of the element (see API_ElemTypeID).
API_ElemVariationID  | variationID
Subcategory of the element (see API_ElemVariationID).
API_Guid  | classID
The classID of the element. It is used when the typeID is API_ExternalElemType.
Detailed Description
The type of an element.
Since
Archicad 26
Constructor & Destructor Documentation
◆ API_ElemType() [1/4]
 API_ElemType::API_ElemType  |  ( |   | )
default
◆ API_ElemType() [2/4]
 API_ElemType::API_ElemType  |  ( |  API_ElemTypeID  |  typeID | )
inline
◆ API_ElemType() [3/4]
 API_ElemType::API_ElemType  |  ( |  API_ElemTypeID  |  typeID,
|  API_ElemVariationID  |  variationID
)
inline
◆ API_ElemType() [4/4]
 API_ElemType::API_ElemType  |  ( |  const API_Guid &  |  classID | )
inline
Member Function Documentation
◆ GenerateHashValue()
 ULong API_ElemType::GenerateHashValue  |  ( |  void  |   | ) |   const
inline
Generates unique identifier.
Returns
the unique value
◆ operator!=() [1/3]
 bool API_ElemType::operator!=  |  ( |  API_ElemTypeID  |  otherTypeID | ) |   const
inline
Comparison operator (by element type ID).
Parameters
otherTypeID | the type of the element to compare to
◆ operator!=() [2/3]
 bool API_ElemType::operator!=  |  ( |  const API_ElemType &  |  other | ) |   const
inline
Comparison operator (by element type).
Parameters
other | the element type to compare to
◆ operator!=() [3/3]
 bool API_ElemType::operator!=  |  ( |  const API_Guid &  |  otherClassID | ) |   const
inline
Comparison operator (by class ID; for external elements).
Parameters
otherClassID | the identifier of the element type to compare to
◆ operator=() [1/3]
 API_ElemType & API_ElemType::operator=  |  ( |  API_ElemTypeID  |  newTypeID | )
inline
Assignment operator (by element type).
Parameters
newTypeID | the new element type
◆ operator=() [2/3]
 API_ElemType & API_ElemType::operator=  |  ( |  const API_ElemType &  |   | )
default
Assignment operator (by element type).
◆ operator=() [3/3]
 API_ElemType & API_ElemType::operator=  |  ( |  const API_Guid &  |  newClassID | )
inline
Assignment operator (by element class identifier).
Parameters
newClassID | the new element type (for external elements)
◆ operator==() [1/3]
 bool API_ElemType::operator==  |  ( |  API_ElemTypeID  |  otherTypeID | ) |   const
inline
Comparison operator (by element type ID).
Parameters
otherTypeID | the type of the element to compare to
◆ operator==() [2/3]
 bool API_ElemType::operator==  |  ( |  const API_ElemType &  |  other | ) |   const
inline
Comparison operator (by element type).
Parameters
other | the element type to compare to
◆ operator==() [3/3]
 bool API_ElemType::operator==  |  ( |  const API_Guid &  |  otherClassID | ) |   const
inline
Comparison operator (by class ID; for external elements).
Parameters
otherClassID | the identifier of the element type to compare to
Member Data Documentation
◆ classID
 API_ElemType::classID
The classID of the element. It is used when the typeID is API_ExternalElemType.
◆ typeID
 API_ElemType::typeID
The typeID of the element (see API_ElemTypeID).
◆ variationID
 API_ElemType::variationID
Subcategory of the element (see API_ElemVariationID).